## Pandas - Missing Data

In [2]:
import numpy as np
import pandas as pd

In [6]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C' :[1,2,3]}

In [12]:
df=pd.DataFrame(d)

In [14]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

Row 0 and colum C has no missing values

### How to drop rows with nan values

In [20]:
df.dropna()

     A    B  C
0  1.0  5.0  1

### How to drop colums with nan values

In [24]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

### Specifying a threshhold

In [29]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

### Replacing Missing values

In [39]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [36]:
df.fillna(value= "Fill value")

            A           B  C
0         1.0         5.0  1
1         2.0  Fill value  2
2  Fill value  Fill value  3